xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
/******************************************************************************
* rtl871x_ioctl.c                                                                                                                                 *
*                                                                                                                                          *
* Description :                                                                                                                       *
*                                                                                                                                           *
* Author :                                                                                                                       *
*                                                                                                                                         *
* History :                                                          
*
*                                        
*                                                                                                                                       *
* Copyright 2007, Realtek Corp.                                                                                                  *
*                                                                                                                                        *
* The contents of this file is the sole property of Realtek Corp.  It can not be                                     *
* be used, copied or modified without written permission from Realtek Corp.                                         *
*                                                                                                                                          *
*******************************************************************************/

#define  _RTL871X_IOCTL_C_
#include <drv_conf.h>
#include <rtl8711_spec.h>
#include <osdep_service.h>
#include <drv_types.h>
#include <wlan_bssdef.h>
#include "wifi.h"
#include <rtl871x_ioctl.h>
#include <rtl871x_ioctl_set.h>
#include <rtl871x_ioctl_query.h>
#ifdef CONFIG_MP_INCLUDED
#include <rtl871x_mp_ioctl.h>
#endif


#define NIC8711_SUPPORTED_FILTERS	\
			NDIS_PACKET_TYPE_DIRECTED | \
			NDIS_PACKET_TYPE_MULTICAST | \
			NDIS_PACKET_TYPE_ALL_MULTICAST | \
			NDIS_PACKET_TYPE_BROADCAST | \
			NDIS_PACKET_TYPE_PROMISCUOUS

NDIS_OID NICSupportedOids[] =
{
    OID_GEN_SUPPORTED_LIST,			//Q
    OID_GEN_HARDWARE_STATUS,		//Q
    OID_GEN_MEDIA_SUPPORTED,		//Q
    OID_GEN_MEDIA_IN_USE,			//Q
    OID_GEN_MAXIMUM_LOOKAHEAD,		//Q
    OID_GEN_MAXIMUM_FRAME_SIZE,		//Q
    OID_GEN_LINK_SPEED,				//Q
    OID_GEN_TRANSMIT_BUFFER_SPACE,	//Q
    OID_GEN_RECEIVE_BUFFER_SPACE,	//Q
    OID_GEN_TRANSMIT_BLOCK_SIZE,		//Q
    OID_GEN_RECEIVE_BLOCK_SIZE,		//Q
    OID_GEN_VENDOR_ID,				//Q
    OID_GEN_VENDOR_DESCRIPTION,		//Q
    OID_GEN_VENDOR_DRIVER_VERSION,	//Q
    OID_GEN_CURRENT_PACKET_FILTER,		//S
    OID_GEN_CURRENT_LOOKAHEAD,		//Q	S
    OID_GEN_DRIVER_VERSION,			//Q
    OID_GEN_MAXIMUM_TOTAL_SIZE,		//Q
    OID_GEN_PROTOCOL_OPTIONS,			//S
    OID_GEN_MAC_OPTIONS,				//Q
    OID_GEN_MEDIA_CONNECT_STATUS,	//Q
    OID_GEN_MAXIMUM_SEND_PACKETS,	//Q
    OID_GEN_XMIT_OK,					//Q
    OID_GEN_RCV_OK,					//Q
    OID_GEN_XMIT_ERROR,				//Q
    OID_GEN_RCV_ERROR,				//Q
    OID_GEN_RCV_NO_BUFFER,			//Q
//    OID_GEN_RCV_CRC_ERROR,			//Optional
//    OID_GEN_TRANSMIT_QUEUE_LENGTH,	//Optional
    OID_GEN_PHYSICAL_MEDIUM,			//Q
//    OID_GEN_NETWORK_LAYER_ADDRESSES,	//Optional
    OID_802_3_PERMANENT_ADDRESS,	//Q
    OID_802_3_CURRENT_ADDRESS,		//Q
    OID_802_3_MULTICAST_LIST,				//S
    OID_802_3_MAXIMUM_LIST_SIZE,		//Q
    OID_802_3_RCV_ERROR_ALIGNMENT,
    OID_802_3_XMIT_ONE_COLLISION,
    OID_802_3_XMIT_MORE_COLLISIONS,
    OID_802_3_XMIT_DEFERRED,
    OID_802_3_XMIT_MAX_COLLISIONS,
    OID_802_3_RCV_OVERRUN,
    OID_802_3_XMIT_UNDERRUN,
    OID_802_3_XMIT_HEARTBEAT_FAILURE,
    OID_802_3_XMIT_TIMES_CRS_LOST,
    OID_802_3_XMIT_LATE_COLLISIONS,


	//mandatory (M), recommended (R), or optional (O)
	//query (Q) - set (S) - indication (I) -2kMe - XP - WPA - WPA2
	OID_802_11_BSSID,	//Q-S- -M-M-M-M
	OID_802_11_SSID,	//Q-S- -M-M-M-M
	OID_802_11_NETWORK_TYPES_SUPPORTED,	//Q- - -R-R-M-M
	OID_802_11_NETWORK_TYPE_IN_USE,		//Q-S- -O-M-M-M
//Optional	OID_802_11_TX_POWER_LEVEL,		//Q-S- -O-O-O-O
	OID_802_11_RSSI,				//Q- -I-O-M-M-M
//Optional	OID_802_11_RSSI_TRIGGER,		//Q-S- -O-O-O-O
	OID_802_11_INFRASTRUCTURE_MODE,
//Optional	OID_802_11_FRAGMENTATION_THRESHOLD,
//Optional	OID_802_11_RTS_THRESHOLD,
//Optional	OID_802_11_NUMBER_OF_ANTENNAS,
//Optional	OID_802_11_RX_ANTENNA_SELECTED,
//Optional	OID_802_11_TX_ANTENNA_SELECTED,
	OID_802_11_SUPPORTED_RATES,
//Optional	OID_802_11_DESIRED_RATES,
	OID_802_11_CONFIGURATION,
	OID_802_11_STATISTICS,
	OID_802_11_ADD_WEP,
	OID_802_11_REMOVE_WEP,
	OID_802_11_WEP_STATUS,
	OID_802_11_DISASSOCIATE,
	OID_802_11_POWER_MODE,
	OID_802_11_BSSID_LIST,
	OID_802_11_AUTHENTICATION_MODE,
//Optional	OID_802_11_PRIVACY_FILTER,
	OID_802_11_BSSID_LIST_SCAN,
	OID_802_11_RELOAD_DEFAULTS,
	OID_802_11_ADD_KEY,
	OID_802_11_REMOVE_KEY,
	OID_802_11_ENCRYPTION_STATUS,
	OID_802_11_ASSOCIATION_INFORMATION,
	OID_802_11_TEST,
	OID_802_11_CAPABILITY,
	OID_802_11_PMKID
};


struct oid_obj_priv oid_segment_0[] =
{
	{1, &oid_null_function},  						//0x00
	{1, &oid_gen_supported_list_hdl}, 			//0x01
	{1, &oid_gen_hardware_status_hdl}, 			//0x02
	{1, &oid_gen_media_supported_hdl},			//0x03
	{1, &oid_gen_media_in_use_hdl}, 			//0x04
	{1, &oid_gen_maximum_lookahead_hdl}, 		//0x05
	{1, &oid_gen_maximum_frame_size_hdl}, 		//0x06
	{1, &oid_gen_link_speed_hdl}, 				//0x07
	{1, &oid_gen_transmit_buffer_space_hdl}, 	//0x08
	{1, &oid_gen_receive_buffer_space_hdl}, 		//0x09
	{1, &oid_gen_transmit_block_size_hdl}, 		//0x0A
	{1, &oid_gen_receive_block_size_hdl}, 		//0x0B
	{1, &oid_gen_vendor_id_hdl}, 				//0x0C
	{1, &oid_gen_vendor_description_hdl}, 		//0x0D
	{1, &oid_gen_current_packet_filter_hdl}, 		//0x0E
	{1, &oid_gen_current_lookahead_hdl}, 		//0x0F
	{1, &oid_gen_driver_version_hdl}, 			//0x10
	{1, &oid_gen_maximum_total_size_hdl},		//0x11
	{1, &oid_gen_protocol_options_hdl}, 			//0x12
	{1, &oid_gen_mac_options_hdl}, 				//0x13
	{1, &oid_gen_media_connect_status_hdl}, 	//0x14
	{1, &oid_gen_maximum_send_packets_hdl}, 	//0x15
	{1, &oid_gen_vendor_driver_version_hdl}		//0x16
};

struct oid_obj_priv oid_segment_1[] =
{
	{1, &oid_null_function},						//0X00
	{1, &oid_null_function},						//0X01
	{1, &oid_gen_physical_medium_hdl}			//0X02
};

struct oid_obj_priv oid_segment_2[] =
{
	{1, &oid_null_function},						//0x00
	{1, &oid_gen_xmit_ok_hdl},					//0x01
	{1, &oid_gen_rcv_ok_hdl},					//0x02
	{1, &oid_gen_xmit_error_hdl},				//0x03
	{1, &oid_gen_rcv_error_hdl},					//0x04
	{1, &oid_gen_rcv_no_buffer_hdl}				//0x05
};

struct oid_obj_priv oid_segment_3[] =
{
	{1, &oid_null_function},						//0x00
	{1, &oid_802_3_permanent_address_hdl},		//0x01
	{1, &oid_802_3_current_address_hdl},		//0x02
	{1, &oid_802_3_multicast_list_hdl},			//0x03
	{1, &oid_802_3_maximum_list_size_hdl},		//0x04
	{1, &oid_802_3_mac_options_hdl}			//0x05
};

struct oid_obj_priv oid_segment_4[] =
{
	{1, &oid_null_function},						//0x00
	{1, &oid_802_3_rcv_error_alignment_hdl},	//0x01
	{1, &oid_802_3_xmit_one_collision_hdl},		//0x02
	{1, &oid_802_3_xmit_more_collisions_hdl}	//0x03
};

struct oid_obj_priv oid_segment_5[] =
{
	{1, &oid_null_function},						//0x00
	{1, &oid_802_3_xmit_deferred_hdl},			//0x01
	{1, &oid_802_3_xmit_max_collisions_hdl},		//0x02
	{1, &oid_802_3_rcv_overrun_hdl},			//0x03
	{1, &oid_802_3_xmit_underrun_hdl},			//0x04
	{1, &oid_802_3_xmit_heartbeat_failure_hdl},	//0x05
	{1, &oid_802_3_xmit_times_crs_lost_hdl},		//0X06
	{1, &oid_802_3_xmit_late_collisions_hdl}		//0X07
};

struct oid_obj_priv oid_segment_6[] =
{
	{1, &oid_pnp_capabilities_hdl},				//0x00
	{1, &oid_pnp_set_power_hdl},				//0x01
	{1, &oid_pnp_query_power_hdl},				//0x02
	{1, &oid_pnp_add_wake_up_pattern_hdl},		//0x03
	{1, &oid_pnp_remove_wake_up_pattern_hdl},	//0x04
	{1, &oid_pnp_wake_up_pattern_list_hdl},		//0x05
	{1, &oid_pnp_enable_wake_up_hdl}			//0X06
};

struct oid_obj_priv oid_segment_7[] =
{
	{1, &oid_null_function},						//0x00
	{1, &oid_802_11_bssid_hdl},					//0x01
	{1, &oid_802_11_ssid_hdl},					//0x02
	{1, &oid_null_function},						//0x03
	{1, &oid_null_function},						//0x04
	{1, &oid_null_function},						//0x05
	{1, &oid_null_function},						//0x06
	{1, &oid_null_function},						//0x07
	{1, &oid_802_11_infrastructure_mode_hdl},	//0x08
	{1, &oid_null_function},						//0x09
	{1, &oid_null_function},						//0x0A
	{1, &oid_null_function},						//0x0B
	{1, &oid_null_function},						//0x0C
	{1, &oid_null_function},						//0x0D
	{1, &oid_null_function},						//0x0E
	{1, &oid_null_function},						//0x0F
	{1, &oid_null_function},						//0x10
	{1, &oid_null_function},						//0x11
	{1, &oid_null_function},						//0x12
	{1, &oid_802_11_add_wep_hdl},				//0x13
	{1, &oid_802_11_remove_wep_hdl},			//0x14
	{1, &oid_802_11_disassociate_hdl},			//0x15
	{1, &oid_null_function},						//0x16
	{1, &oid_null_function},						//0x17
	{1, &oid_802_11_authentication_mode_hdl},	//0x18
	{1, &oid_802_11_privacy_filter_hdl},			//0x19
	{1, &oid_802_11_bssid_list_scan_hdl},		//0x1A
	{1, &oid_802_11_encryption_status_hdl},		//0x1B
	{1, &oid_802_11_reload_defaults_hdl},		//0x1C
	{1, &oid_802_11_add_key_hdl},				//0x1D
	{1, &oid_802_11_remove_key_hdl},			//0x1E
	{1, &oid_802_11_association_information_hdl},//0x1F
	{1, &oid_802_11_test_hdl},					//0x20
	{1, &oid_802_11_media_stream_mode_hdl},	//0x21
	{1, &oid_802_11_capability_hdl},				//0x22
	{1, &oid_802_11_pmkid_hdl}					//0x23
};

struct oid_obj_priv oid_segment_8[] =
{
	{1, &oid_null_function},							//0x00
	{1, &oid_null_function},							//0x01
	{1, &oid_null_function},							//0x02
	{1, &oid_802_11_network_types_supported_hdl},	//0x03
	{1, &oid_802_11_network_type_in_use_hdl},		//0x04
	{1, &oid_802_11_tx_power_level_hdl},			//0x05
	{1, &oid_802_11_rssi_hdl},						//0x06
	{1, &oid_802_11_rssi_trigger_hdl},				//0x07
	{1, &oid_null_function},							//0x08
	{1, &oid_802_11_fragmentation_threshold_hdl},	//0x09
	{1, &oid_802_11_rts_threshold_hdl},				//0x0A
	{1, &oid_802_11_number_of_antennas_hdl},		//0x0B
	{1, &oid_802_11_rx_antenna_selected_hdl},		//0x0C
	{1, &oid_802_11_tx_antenna_selected_hdl},		//0x0D
	{1, &oid_802_11_supported_rates_hdl},			//0x0E
	{1, &oid_null_function},							//0x0F
	{1, &oid_802_11_desired_rates_hdl},				//0x10
	{1, &oid_802_11_configuration_hdl},				//0x11
	{1, &oid_null_function},							//0x12
	{1, &oid_null_function},							//0x13
	{1, &oid_null_function},							//0x14
	{1, &oid_null_function},							//0x15
	{1, &oid_802_11_power_mode_hdl},				//0X16		
	{1, &oid_802_11_bssid_list_hdl}					//0X17		
};

struct oid_obj_priv oid_segment_9[] =
{
	{1, &oid_null_function},							//0x00
	{1, &oid_null_function},							//0x01
	{1, &oid_null_function},							//0x02
	{1, &oid_null_function},							//0x03
	{1, &oid_null_function},							//0x04
	{1, &oid_null_function},							//0x05
	{1, &oid_null_function},							//0x06
	{1, &oid_null_function},							//0x07
	{1, &oid_null_function},							//0x08
	{1, &oid_null_function},							//0x09
	{1, &oid_null_function},							//0x0A
	{1, &oid_null_function},							//0x0B
	{1, &oid_null_function},							//0x0C
	{1, &oid_null_function},							//0x0D
	{1, &oid_null_function},							//0x0E
	{1, &oid_null_function},							//0x0F
	{1, &oid_null_function},							//0x10
	{1, &oid_null_function},							//0x11
	{1, &oid_802_11_statistics_hdl}					//0X12	
};


struct oid_funs_node oid_funs_array[] = 
{
	{0x00010100, 0x000101FF, oid_segment_0, sizeof(oid_segment_0), 0, 0},
	{0x00010200, 0x000102FF, oid_segment_1, sizeof(oid_segment_1), 0, 0},
	{0x00020100, 0x000201FF, oid_segment_2, sizeof(oid_segment_2), 0, 0},
	{0x01010100, 0x010101FF, oid_segment_3, sizeof(oid_segment_3), 0, 0},
	{0x01020100, 0x010201FF, oid_segment_4, sizeof(oid_segment_4), 0, 0},
	{0x01020200, 0x010202FF, oid_segment_5, sizeof(oid_segment_5), 0, 0},
	{0xFD010100, 0xFD0101FF, oid_segment_6, sizeof(oid_segment_6), 0, 0},
	{0x0D010100, 0x0D0101FF, oid_segment_7, sizeof(oid_segment_7), 0, 0},
	{0x0D010200, 0x0D0102FF, oid_segment_8, sizeof(oid_segment_8), 0, 0},
	{0x0D020200, 0x0D0202FF, oid_segment_9, sizeof(oid_segment_9), 0, 0}
};
//u8 DescString8711_SDIO[]="Realtek RTL8711 Wireless LAN SDIO NIC                                     ";
#ifdef CONFIG_SDIO_HCI
u8 desc_string8711[]="Realtek RTL8711 Wireless LAN SDIO NIC                                     ";
#elif CONFIG_USB_HCI
u8 desc_string8711[]="Realtek RTL8711 Wireless LAN USB NIC                                      ";
#elif CONFIG_CFIO_HCI
u8 desc_string8711[]="Realtek RTL8711 Wireless LAN CFIO NIC                                     ";
#endif



NDIS_STATUS
oid_null_function(	struct oid_par_priv* poid_par_priv)
{
	_func_enter_;
	_func_exit_;
	return NDIS_STATUS_SUCCESS;
}


NDIS_STATUS copy_oid_info(struct oid_par_priv* poid_par_priv, PVOID pinfo, u32 info_len)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	_func_enter_;
	if(info_len <= poid_par_priv->information_buf_len)
	{
		// Copy result into InformationBuffer
		if(info_len)
		{
			*poid_par_priv->bytes_rw = info_len;
			_memcpy(poid_par_priv->information_buf, pinfo, info_len);
		}
	}
	else
	{
		// Buffer too short			
		*poid_par_priv->bytes_needed = info_len;
		status = NDIS_STATUS_BUFFER_TOO_SHORT;
	}
	_func_exit_;
	return status;
}






NDIS_STATUS FillQueryInformation(IN PVOID src, IN u32 srcLength, OUT PVOID dest, IN u32 destLength, OUT u32 *BytesWritten, u32 *BytesNeeded){
	NDIS_STATUS			Status = NDIS_STATUS_SUCCESS;
	_func_enter_;
	if (src == NULL || dest == NULL){
		_func_exit_;
		return NDIS_STATUS_NOT_SUPPORTED;
	}

	if (srcLength <= destLength) {
		
		if (destLength > 0){

			*BytesWritten = srcLength;
			_memcpy(dest, src, srcLength);

		} else {

