xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
			*BytesWritten = 0;
		}

	} else {

		// dest buffer is too short
		*BytesNeeded = srcLength;
		*BytesWritten = 0;
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;
	}
	_func_exit_;
	return NDIS_STATUS_SUCCESS;
}



//1Query Functions for Segment 1


NDIS_STATUS
query_oid_gen_supported_list(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	//unsigned db = poid_par_priv->dbg;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	pInfo = (PVOID) NICSupportedOids;
	ulInfoLen = sizeof(NICSupportedOids);
	
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}





NDIS_STATUS
query_oid_gen_hardware_status(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u8			bInformationCopied = _FALSE;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	
	ulInfo = NdisHardwareStatusReady;
	DEBUG_INFO(("Query Information, OID_GEN_HARDWARE_STATUS: 0x%08X\n", ulInfo));

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_media_supported(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NdisMedium802_3;
	DEBUG_ERR(("\nQuery Information, OID_GEN_MEDIA_SUPPORTED: %08x\n", ulInfo));

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_media_in_use(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NdisMedium802_3;
	DEBUG_ERR( ("\nQuery Information, OID_GEN_MEDIA_IN_USE: %08x\n", ulInfo));

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}



NDIS_STATUS
query_oid_gen_maximum_lookahead(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NIC_MAX_PACKET_SIZE - NIC_HEADER_SIZE;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_maximum_frame_size(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NIC_MAX_PACKET_SIZE - NIC_HEADER_SIZE;
			
	 if(Adapter->registrypriv.mp_mode == 1 )
       {
		ulInfo = (u32) (ulInfo + 16);
       }
	else
	{
		ulInfo = (u32) ulInfo;
	}
		
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	 _func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_link_speed_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = 250000;
#ifdef CONFIG_USB_HCI
	ulInfo = 540000;
#endif

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_transmit_buffer_space_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	// The OID_GEN_TRANSMIT_BUFFER_SPACE OID specifies the amount of memory, in bytes, on the NIC that is available for 
	// buffering transmit data. A protocol can use this OID as a guide for sizing the amount of transmit data per send.
	ulInfo = NIC_MAX_PACKET_SIZE * 40;//DDK: * Adapter->NumTcb;
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}






NDIS_STATUS
query_oid_gen_receive_buffer_space_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	// The OID_GEN_RECEIVE_BUFFER_SPACE OID specifies the amount of memory on the NIC that is available for buffering receive data.
	// A protocol driver can use this OID as a guide for advertising its receive window after it establishes sessions with remote nodes.
	ulInfo = NIC_MAX_PACKET_SIZE * 10;//DDK: * Adapter->CurrNumRfd;
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_transmit_block_size(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

