xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	ulInfo = (u32) NIC_MAX_PACKET_SIZE;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_receive_block_size(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = (u32) NIC_MAX_PACKET_SIZE;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_vendor_id_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_adapter *			padapter = (_adapter*)(poid_par_priv->adapter_context);
	
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	// The OID_GEN_VENDOR_ID OID specifies a three-byte IEEE-registered vendor code, followed by a single byte 
	// that the vendor assigns to identify a particular NIC.
		
	//NdisMoveMemory(Adapter->CurrentAddress, pHalData->EEPROMMACAddress, 6);//marked by yt; 20061107
	
	_memcpy(&ulInfo, padapter->eeprompriv.mac_addr, 3);
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}





NDIS_STATUS
query_oid_gen_vendor_description_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;


	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	// The OID_GEN_VENDOR_DESCRIPTION OID points to a null-terminated string describing the NIC.
	//Status = FillQueryInformation((PVOID)&VendorDesc, sizeof(VendorDesc), InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;
	pInfo = (PVOID)desc_string8711;
	ulInfoLen = strlen((const s8*)desc_string8711)+1;
	DEBUG_ERR( ("\nQuery Information, OID_GEN_VENDOR_DESCRIPTION:%s\n",(char *)pInfo));


			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}

NDIS_STATUS
query_oid_gen_current_packet_filter(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	// The OID_GEN_CURRENT_PACKET_FILTER OID specifies the types of net packets for which a protocol receives indications 
	// from a NIC driver. This NIC driver reports its medium type as one for which the system provides a filter library. 

	// NDIS_PACKET_TYPE_ALL_MULTICAST 
	//		All multicast address packets, not just the ones enumerated in the multicast address list. 

	// NDIS_PACKET_TYPE_PROMISCUOUS 
	//		Specifies all packets. 

	ulInfo = Adapter->NdisPacketFilter;

	//DEBUG_ERR( ("Query Information, OID_GEN_CURRENT_PACKET_FILTER:%d \n", ulInfo));
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}



NDIS_STATUS
query_oid_gen_current_lookahead(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NIC_MAX_PACKET_SIZE - NIC_HEADER_SIZE;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_driver_version_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u16		usInfo = 0;
	u32			usInfoLen = sizeof(usInfo);
	PVOID				pInfo = (PVOID) &usInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	usInfo = (USHORT) ((NDIS_MAJOR_VERSION << 8) + NDIS_MINOR_VERSION) ;
	DEBUG_ERR( ("\nQuery Information, OID_GEN_DRIVER_VERSION:%08x\n",usInfo));  
			
       status = copy_oid_info(poid_par_priv, pInfo, usInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_maximum_total_size(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = (u32) NIC_MAX_PACKET_SIZE;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	   _func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_mac_options(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo =	NDIS_MAC_OPTION_TRANSFERS_NOT_PEND |
#if COALESCE_RECEIVED_PACKET
					NDIS_MAC_OPTION_COPY_LOOKAHEAD_DATA | 
#endif
					NDIS_MAC_OPTION_NO_LOOPBACK;

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




NDIS_STATUS
query_oid_gen_media_connect_status(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	struct mlme_priv* 	pmlmepriv = &Adapter->mlmepriv;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	ulInfo = (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE)?  
				NdisMediaStateConnected : NdisMediaStateDisconnected;

