xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	if(Adapter->registrypriv.mp_mode == 1 )
		ulInfo = NdisMediaStateConnected;


	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}


NDIS_STATUS
query_oid_gen_maximum_send_packets(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	// For Deserialized Miniport Drivers
	// NDIS ignores any value returned by a deserialized driver in response to a query of OID_GEN_MAXIMUM_SEND_PACKETS. 
	// NDIS does not adjust the size of the array of packet descriptors that it supplies to a deserialized miniport's 
	// MiniportSendPackets function.

	// If the underlying driver has only a MiniportSend function, it should return one for this query. 
	// In this case, NDIS will always pass one packet to the array at PacketArray.

	ulInfo = 1;
	//Status = FillQueryInformation((PVOID)&ulInfo, 1, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	DEBUG_ERR( ("\nQuery Information, OID_GEN_MAXIMUM_SEND_PACKETS:%d\n",ulInfo));                        
	//return Status;
			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}


NDIS_STATUS
query_oid_gen_vendor_driver_version(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	// The OID_GEN_VENDOR_DRIVEN_VERSION OID specifies the vendor-assigned version number of the NIC driver. 
	// The low-order half of the return value specifies the minor version; the high-order half specifies the major version. 
	ulInfo = NIC_VENDOR_DRIVER_VERSION;
	DEBUG_ERR( ("Query Information, OID_GEN_VENDOR_DRIVER_VERSION:%08x\n",ulInfo));
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;
	
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}




//1Query Functions for Segment 2

NDIS_STATUS query_oid_gen_physical_medium(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	DEBUG_ERR(("Query OID_GEN_PHYSICAL_MEDIUM\n"));

       if(Adapter->registrypriv.mp_mode == 1 )
       {
		ulInfo = NdisPhysicalMediumUnspecified;
		DEBUG_ERR( ("Query Information, OID_GEN_PHYSICAL_MEDIUM:%d(NdisPhysicalMediumUnspecified)\n", ulInfo));
       }
	else
	{
		ulInfo = NdisPhysicalMediumWirelessLan;
		DEBUG_ERR( ("Query Information, OID_GEN_PHYSICAL_MEDIUM:%d(NdisPhysicalMediumWirelessLan)\n", ulInfo));
	}

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}



//1Query Functions for Segment 3

NDIS_STATUS query_oid_gen_xmit_ok(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	// The OID_GEN_XMIT_OK OID specifies the number of frames that are transmitted without errors.
	if(poid_par_priv->information_buf_len >= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len == 4) {

		ulInfoLen = 4;

	} else {

		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}

	status = FillQueryInformation((PVOID)&Adapter->xmitpriv.tx_pkts, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}


NDIS_STATUS query_oid_gen_rcv_ok(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;



	_func_enter_;
	// The OID_GEN_RCV_OK OID specifies the number of frames that the NIC receives without errors and indicates to bound protocols.
	if(poid_par_priv->information_buf_len >= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len == 4) {

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}
	
	status = FillQueryInformation((PVOID)&Adapter->recvpriv.rx_pkts, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}

NDIS_STATUS query_oid_gen_xmit_error(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;


	// The OID_GEN_XMIT_ERROR OID specifies the number of frames that a NIC fails to transmit.
	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

