xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	}
	
	status = FillQueryInformation((PVOID)&Adapter->xmitpriv.tx_drop, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}


NDIS_STATUS query_oid_gen_rcv_error(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;





	// The OID_GEN_RCV_ERROR OID specifies the number of frames that a NIC receives but does not indicate to the protocols due to errors.
	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}
	
	status = FillQueryInformation((PVOID)&Adapter->recvpriv.rx_drop, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}



NDIS_STATUS query_oid_gen_rcv_no_buffer(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	// The OID_GEN_RCV_ERROR OID specifies the number of frames that a NIC receives but does not indicate to the protocols due to errors.
	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}
	
	//status = FillQueryInformation((PVOID)&Adapter->recvpriv.rx_no_buffer, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}




//1Query Functions for Segment 4

NDIS_STATUS query_oid_802_3_permanent_address(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);


	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	//RTDumpHex("Query Information, OID_802_3_PERMANENT_ADDRESS", Adapter->PermanentAddress, 6, ':');
	//Status = FillQueryInformation((PVOID)Adapter->PermanentAddress, ETH_LENGTH_OF_ADDRESS, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;

	//NdisMoveMemory(Adapter->PermanentAddress, SDIO_HWADDR, 6);
//	NdisMoveMemory(Adapter->eeprompriv.mac_addr, Adapter->eeprompriv.mac_addr, 6);
	
	pInfo = Adapter->eeprompriv.mac_addr;
	ulInfoLen = ETH_LENGTH_OF_ADDRESS;
	DEBUG_ERR(("Query Information, OID_802_3_PERMANENT_ADDRESS:%02x:%02x:%02x:%02x:%02x:%02x\n", 
		Adapter->eeprompriv.mac_addr[0], Adapter->eeprompriv.mac_addr[1], Adapter->eeprompriv.mac_addr[2], 
		Adapter->eeprompriv.mac_addr[3],Adapter->eeprompriv.mac_addr[4], Adapter->eeprompriv.mac_addr[5]));

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}

NDIS_STATUS query_oid_802_3_current_address(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);


	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	//NdisMoveMemory(Adapter->CurrentAddress, pHalData->EEPROMMACAddress, 6);
	
	pInfo = Adapter->eeprompriv.mac_addr;
	ulInfoLen = ETH_LENGTH_OF_ADDRESS;
	//DEBUG_ERR( ("Query Information, OID_802_3_CURRENT_ADDRESS:%02x:%02x:%02x:%02x:%02x:%02x\n", Adapter->CurrentAddress[0], Adapter->CurrentAddress[1], Adapter->CurrentAddress[2], Adapter->CurrentAddress[3], Adapter->CurrentAddress[4], Adapter->CurrentAddress[5]));            

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}
	
NDIS_STATUS query_oid_802_3_multicast_list(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	DEBUG_ERR( ("Query OID_802_3_MULTICAST_LIST:\n"));
	{
		u32 MCListSize = Adapter->MCAddrCount*6;
		if( poid_par_priv->information_buf_len < MCListSize )
		{
			*poid_par_priv->bytes_needed = MCListSize;
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_BUFFER_TOO_SHORT;
		}

		_memcpy( poid_par_priv->information_buf, Adapter->MCList, MCListSize );
		*poid_par_priv->bytes_rw = MCListSize;
	}
	_func_exit_;
	return (status);
	
}
		
NDIS_STATUS query_oid_802_3_maximum_list_size(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	// The maximum number of multicast addresses the NIC driver can manage. 
	ulInfo = MAX_MCAST_LIST_NUM;
	//Status = FillQueryInformation((PVOID)&ulInfo, 4, InformationBuffer, InformationBufferLength, BytesWritten, BytesNeeded);
	//return Status;

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
}





//1Query Functions for Segment 5

NDIS_STATUS query_oid_802_3_rcv_error_alignment(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

