xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}			
	
	status = FillQueryInformation((PVOID)&ul64Info, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}

NDIS_STATUS query_oid_802_3_xmit_one_collision(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}			
	
	status = FillQueryInformation((PVOID)&ul64Info, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}
	
NDIS_STATUS query_oid_802_3_xmit_more_collisions(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	if(poid_par_priv->information_buf_len>= 8) {

		ulInfoLen = sizeof(ul64Info);

	} else if(poid_par_priv->information_buf_len== 4)	{

		ulInfoLen = 4;

	} else {
		_func_exit_;
		return NDIS_STATUS_BUFFER_TOO_SHORT;

	}			
	
	status = FillQueryInformation((PVOID)&ul64Info, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}




//1Query Functions for Segment 6
//1Query Functions for Segment 7

NDIS_STATUS
query_oid_pnp_query_power(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	
	ulInfo = (ULONG)(NdisDeviceStateD3);	
	
	status = FillQueryInformation((PVOID)&ulInfo, ulInfoLen, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;
	
}


//1Query Functions for Segment 8

NDIS_STATUS query_oid_802_11_bssid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	// When queried, this OID requests that the miniport driver return the MAC address of the associated AP. 
	// If the device is operating in ad hoc mode, the miniport driver returns the IBSS MAC address. 
	// The miniport driver must return an error code of NDIS_STATUS_ADAPTER_NOT_READY if the device is neither operating in ad hoc mode 
	// nor associated with an AP.

	{
		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		NDIS_WLAN_BSSID_EX  *pcur_bss = &pmlmepriv->cur_network.network;
		u8 zero_string[ETH_ALEN] = {0x0,0x0,0x0,0x0,0x0,0x0};
	
		//if(pmlmepriv->fw_state & _FW_LINKED)  //jackson 0827
		if  ( ((check_fwstate(pmlmepriv, _FW_LINKED)) == _TRUE) || 
			((check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE)) == _TRUE) ||
			((check_fwstate(pmlmepriv, WIFI_AP_STATE)) == _TRUE) )
		{
			status = FillQueryInformation((PVOID)&(pcur_bss->MacAddress), 
										sizeof(NDIS_802_11_MAC_ADDRESS), 
										poid_par_priv->information_buf, 
										poid_par_priv->information_buf_len, 
										poid_par_priv->bytes_rw, 
										poid_par_priv->bytes_needed);
			_func_exit_;
			return status;

		} else {

			DEBUG_ERR( ("Query OID_802_11_BSSID: NDIS_STATUS_ADAPTER_NOT_READY\n"));
			status = FillQueryInformation((PVOID)zero_string, 
										sizeof(NDIS_802_11_MAC_ADDRESS), 
										poid_par_priv->information_buf, 
										poid_par_priv->information_buf_len, 
										poid_par_priv->bytes_rw, 
										poid_par_priv->bytes_needed);
			_func_exit_;
			return NDIS_STATUS_ADAPTER_NOT_READY;
		}


	
	}


	
}

NDIS_STATUS query_oid_802_11_ssid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	// When queried, this OID requests that the miniport driver return the SSID with which the device is associated. 
	// The miniport driver returns zero for the SsidLength member if the device is not associated with an SSID.

	{
		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		NDIS_WLAN_BSSID_EX  *pcur_bss = &pmlmepriv->cur_network.network;

	

		if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) ||
		      (check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE))

		{
			status = FillQueryInformation((PVOID)&(pcur_bss->Ssid), 
										sizeof( pcur_bss->Ssid.SsidLength) + pcur_bss->Ssid.SsidLength, 
										poid_par_priv->information_buf, 
										poid_par_priv->information_buf_len, 
										poid_par_priv->bytes_rw, 
										poid_par_priv->bytes_needed);



		} else {
			NDIS_802_11_SSID zero_ssid;	
			pcur_bss->Ssid.SsidLength = 0;

			memset(&zero_ssid, 0, sizeof(NDIS_802_11_SSID));
			
			status = FillQueryInformation((PVOID)&zero_ssid,
										FIELD_OFFSET(NDIS_802_11_SSID, Ssid),
										poid_par_priv->information_buf, 
										poid_par_priv->information_buf_len, 
										poid_par_priv->bytes_rw, 
										poid_par_priv->bytes_needed);
		}
		_func_exit_;
		return NDIS_STATUS_SUCCESS;  //0827

	
