xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	}

	
}

NDIS_STATUS query_oid_802_11_infrastructure_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	_func_enter_;
	// When queried, this OID requests that the miniport driver return its current network mode setting. 
	// If queried without a prior setting of this OID, the driver must return NDIS_STATUS_ADAPTER_NOT_READY.


	{
		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		NDIS_802_11_NETWORK_INFRASTRUCTURE network_mode;
			

		if (check_fwstate(pmlmepriv, WIFI_STATION_STATE) == _TRUE)
		{
			network_mode = Ndis802_11Infrastructure ;	
		}
		else if  ((check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE) ||
			       (check_fwstate(pmlmepriv, WIFI_ADHOC_STATE) == _TRUE))
			
		{
			network_mode = Ndis802_11IBSS;		
		}
		else
		{
			network_mode = Ndis802_11AutoUnknown ;
		}
			
		status = FillQueryInformation((PVOID)&network_mode, 
									sizeof(NDIS_802_11_NETWORK_INFRASTRUCTURE),
									poid_par_priv->information_buf, 
									poid_par_priv->information_buf_len, 
									poid_par_priv->bytes_rw, 
									poid_par_priv->bytes_needed);
		_func_exit_;
		return status;
	}
	


	
	
	
}

NDIS_STATUS query_oid_802_11_authentication_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	// When queried, this OID requests that the miniport driver return its IEEE 802.11 authentication mode.
	{
		NDIS_802_11_AUTHENTICATION_MODE	authmode;
		authmode=Adapter->securitypriv.ndisauthtype;
		//MgntActQuery_802_11_AUTHENTICATION_MODE( Adapter, &authmode );
		ulInfo = authmode;
		DEBUG_ERR( ("Query OID_802_11_AUTHENTICATION_MODE: %d\n",authmode));
	}
	
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
	
}

NDIS_STATUS query_oid_802_11_encryption_status(struct oid_par_priv* poid_par_priv)
{
	
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
// ----------MgntInfo----------------------	
//	PMGNT_INFO     		pMgntInfo;
//	pMgntInfo = &Adapter->MgntInfo;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	// When queried, this OID requests that the miniport driver return its current encryption mode. 
	// In response, the miniport driver can indicate which encryption mode is enabled or disabled, that the transmit key is absent, 
	// or that encryption is not supported.

	// The data passed in a query or set of this OID is the NDIS_802_11_ENCRYPTION_STATUS enumeration, 
	// which defines the following encryption status values:

	//! \todo review OID_802_11_ENCRYPTION_STATUS please.

	switch(Adapter->securitypriv.ndisencryptstatus) {
		case Ndis802_11Encryption1Enabled:
			if(Adapter->securitypriv.dot11DefKeylen[Adapter->securitypriv.dot11PrivacyKeyIndex]== 0){
				ulInfo = Ndis802_11Encryption1KeyAbsent;
				DEBUG_ERR( ("Query OID_802_11_ENCRYPTION_STATUS: Ndis802_11Encryption1KeyAbsent\n"));
			}
			else
				ulInfo = Adapter->securitypriv.ndisencryptstatus;
			break;
			
		case Ndis802_11Encryption2Enabled:
			ulInfo = Adapter->securitypriv.ndisencryptstatus;
			break;
			
		case Ndis802_11Encryption3Enabled:
				ulInfo = Adapter->securitypriv.ndisencryptstatus;
			break;

		default:
			ulInfo = Adapter->securitypriv.ndisencryptstatus;
			break;
	}
	DEBUG_ERR( ("Query OID_802_11_ENCRYPTION_STATUS: %d\n", Adapter->securitypriv.ndisencryptstatus));

	_func_exit_;
	return status;
}



NDIS_STATUS query_oid_802_11_association_information(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	{
		PNDIS_802_11_ASSOCIATION_INFORMATION pAssocInfo = (PNDIS_802_11_ASSOCIATION_INFORMATION)&padapter->securitypriv.assoc_info;
		memset(&padapter->securitypriv.assoc_info, 0, sizeof(NDIS_802_11_ASSOCIATION_INFORMATION));
		query_802_11_association_information(padapter, pAssocInfo);

		pInfo = pAssocInfo;
		ulInfoLen = sizeof(NDIS_802_11_ASSOCIATION_INFORMATION) +	\
										pAssocInfo->RequestIELength + 				\
										pAssocInfo->ResponseIELength;

		DEBUG_ERR( ("Query OID_802_11_ASSOCIATION_INFORMATION, length=%d\n", ulInfoLen ) );
	}

			
       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
	
}

NDIS_STATUS query_oid_802_11_capability(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	_func_enter_;
	// This OID is used to query the miniport driver for its supported wireless network authentication and encryption capabilities.

	// Only miniport drivers that support WPA2 functionality can support this OID. When queried, the driver must indicate that it supports both WPA2:AES and WPA-PSK2:AES in order to be considered WPA2-capable by the operating system.

	// Drivers that only support WPA must return NDIS_STATUS_NOT_SUPPORTED when this OID is queried.

	// In response to a query of this OID, the miniport driver returns an NDIS_802_11_CAPABILITY structure, which is defined as follows:
	{
		
		//pInfo = &(pMgntInfo->SecurityInfo.szCapability[0]);
		pInfo = &(Adapter->securitypriv.szofcapability[0]);

		query_802_11_capability( Adapter, (u8*)pInfo, &ulInfoLen );
		
	//! \todo process OID_802_11_CAPABILITY.
		DEBUG_ERR( ("Query OID_802_11_CAPABILITY.\n"));
	}

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
	
	
