xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
}
	
NDIS_STATUS query_oid_802_11_pmkid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;


	DEBUG_ERR( ("Query OID_802_11_PMKID.\n"));


	_func_exit_;
	return (status);
	
	
}



//1Query Functions for Segment 9

NDIS_STATUS query_oid_802_11_network_types_supported(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;
	struct registry_priv	*pregistrypriv = &Adapter->registrypriv;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	// When queried, the OID_802_11_NETWORK_TYPES_SUPPORTED OID requests that the miniport driver return an array of 
	// all the network types that the underlying NIC's physical layer (PHY) supports. 
	// If the NIC supports multiple 802.11 radios, the driver returns all applicable network types.
	DEBUG_ERR( ("Query OID_802_11_NETWORK_TYPES_SUPPORTED: \n"));
	{

		if (poid_par_priv->information_buf_len < (sizeof(NDIS_802_11_NETWORK_TYPE) * 3 + sizeof(u32))){
			*poid_par_priv->bytes_rw = 0;
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_NETWORK_TYPE) * 3 + sizeof(u32);
			return NDIS_STATUS_BUFFER_TOO_SHORT;

		} else {
			
			NDIS_802_11_NETWORK_TYPE_LIST	*networkType = (NDIS_802_11_NETWORK_TYPE_LIST *)poid_par_priv->information_buf;

			if(pregistrypriv->wireless_mode == WIRELESS_11B)
			{
				
				networkType->NumberOfItems = 1;
				networkType->NetworkType[0] = Ndis802_11DS;
			
			}
			else if (pregistrypriv->wireless_mode == WIRELESS_11BG)
			{
				
				networkType->NumberOfItems = 2;
				networkType->NetworkType[0] = Ndis802_11DS;
				networkType->NetworkType[1] = Ndis802_11OFDM24;
			
			}
			else if  (pregistrypriv->wireless_mode == WIRELESS_11G)
			{
				networkType->NumberOfItems = 1;
				networkType->NetworkType[0] = Ndis802_11OFDM24;
			}
			
			else
				networkType->NumberOfItems = 0;

			*poid_par_priv->bytes_rw = 	sizeof(NDIS_802_11_NETWORK_TYPE) * networkType->NumberOfItems 
							+ sizeof(u32);
			*poid_par_priv->bytes_needed = 0;
				
			_func_exit_;
			return NDIS_STATUS_SUCCESS;			



			 
		}

	}

	
	
}

NDIS_STATUS query_oid_802_11_network_type_in_use(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	// When this OID is queried, the miniport driver must return the network type that is currently in use. 
	// For example, if the device is associated with an 802.11g access point that is using OFDM 2.4, 
	// the miniport returns Ndis802_11OFDM24. 
	// If the network type changes to DSSS, the miniport returns Ndis802_11DS when the OID is queried.

	// The miniport driver returns NDIS_STATUS_INVALID_DATA if an invalid type is specified in the request.

	DEBUG_ERR( ("Query OID_802_11_NETWORK_TYPE_IN_USE: \n"));

	{
		
		NDIS_WLAN_BSSID_EX *pnetwork;
		struct mlme_priv* pmlmepriv = &Adapter->mlmepriv;

		if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) ||
			(check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE))
			pnetwork = &pmlmepriv->cur_network.network;
		else
			pnetwork = &(Adapter->registrypriv.dev_network);
		
		ulInfo =pnetwork->NetworkTypeInUse;

	}
	status = FillQueryInformation((PVOID)&ulInfo, 4, poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
	_func_exit_;
	return status;

		
	
}
	
NDIS_STATUS query_oid_802_11_rssi(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	// When queried, the OID_802_11_RSSI OID requests that the miniport driver return the current value of 
	// the received signal strength indication (RSSI).
	
	// The RSSI is measured in dBm, and the data type is defined as follows:
	//		typedef LONG  NDIS_802_11_RSSI;

	// The normal range for the RSSI values is from -10 through -200dBm.

	// A query of this OID is only valid when the device is associated. 
	// The driver must return NDIS_STATUS_ADAPTER_NOT_READY if the device is not associated.

	// A query of this OID must not cause the device to send or receive packets in order to determine the RSSI value.

	// Translate to dBm
	{
		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		NDIS_WLAN_BSSID_EX  *pcur_bss = &pmlmepriv->cur_network.network;


		pcur_bss->Rssi = -10;

		status = FillQueryInformation((PVOID)&pcur_bss->Rssi, 
									4, 
									poid_par_priv->information_buf, 
									poid_par_priv->information_buf_len, 
									poid_par_priv->bytes_rw, 
									poid_par_priv->bytes_needed);
		
		//DEBUG_ERR( ("Query OID_802_11_RSSI: %d\n", pcur_bss->Rssi));
		_func_exit_;
		return status;


	}



}
	
NDIS_STATUS query_oid_802_11_supported_rates(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	{
		NDIS_802_11_RATES_EX* prates;
		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		NDIS_WLAN_BSSID_EX  *pcur_bss = &pmlmepriv->cur_network.network;

 		
