xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
		if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) ||
                    (check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE))
			prates = &pcur_bss->SupportedRates;
		else
			prates = &Adapter->registrypriv.dev_network.SupportedRates;
	
		status = FillQueryInformation(prates, 
									sizeof(NDIS_802_11_RATES), 
									poid_par_priv->information_buf, 
									poid_par_priv->information_buf_len, 
									poid_par_priv->bytes_rw, 
									poid_par_priv->bytes_needed);
		_func_exit_;
		return status;
	}



}
	
NDIS_STATUS query_oid_802_11_configuration(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	{
		NDIS_802_11_CONFIGURATION		config80211;
		NDIS_802_11_CONFIGURATION		*pnic_Config;

		struct	mlme_priv	*pmlmepriv = &Adapter->mlmepriv;

		DEBUG_ERR( ("Query OID_802_11_CONFIGURATION: \n"));

		if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) ||
			(check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE))
			pnic_Config = &pmlmepriv->cur_network.network.Configuration;
		else
			pnic_Config = &Adapter->registrypriv.dev_network.Configuration;

		_memcpy(&config80211, pnic_Config, sizeof(NDIS_802_11_CONFIGURATION));
		
		
		if((check_fwstate(pmlmepriv, WIFI_STATION_STATE)==_TRUE) ||
       	    (check_fwstate(pmlmepriv, WIFI_AP_STATE)==_TRUE) )
		{
			config80211.DSConfig = 0;
			config80211.ATIMWindow = 0;
		}

		if(check_fwstate(pmlmepriv, _FW_LINKED)==_FALSE)
			config80211.BeaconPeriod = 0;

		status = FillQueryInformation((PVOID)&config80211, sizeof(NDIS_802_11_CONFIGURATION), poid_par_priv->information_buf, poid_par_priv->information_buf_len, poid_par_priv->bytes_rw, poid_par_priv->bytes_needed);
		_func_exit_;
		return status;

	}
	
}

NDIS_STATUS query_oid_802_11_power_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	// When queried, this OID requests that the miniport driver return the current power mode of the NIC.
#ifdef CONFIG_SDIO_HCI

	status = FillQueryInformation((PVOID)&Adapter->dvobjpriv.regpwrsave, 
								4, 
								poid_par_priv->information_buf, 
								poid_par_priv->information_buf_len, 
								poid_par_priv->bytes_rw, 
								poid_par_priv->bytes_needed);
#endif
	_func_exit_;
	return status;
	

}
	
NDIS_STATUS query_oid_802_11_bssid_list(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	{

		u32		bufSizeRequired, bssid_ex_sz;
		PNDIS_802_11_BSSID_LIST_EX	pNdisBssListEx;
		PNDIS_WLAN_BSSID_EX		pNdisBssEx;
		
		_irqL	irqL;


		u32	no_report = 0;


		struct	mlme_priv	*pmlmepriv = &(Adapter->mlmepriv);
		_queue				*queue	= &(pmlmepriv->scanned_queue);
		_list					*plist, *phead;
		struct	wlan_network	*pnetwork = NULL;
		struct  	wlan_network	*oldest = NULL;

		DEBUG_ERR( (" Start of Query OID_802_11_BSSID_LIST.\n"));
		
		// step1. calculate if(InformationBufferLength < bufSizeRequired)
		//_init_listhead(&h2c.list);


		if (poid_par_priv->information_buf_len < sizeof(u32)) {

				// only ask for a rought estimate...
				
				*poid_par_priv->bytes_needed = 
				pmlmepriv->num_of_scanned * (sizeof(NDIS_WLAN_BSSID_EX) );
				*poid_par_priv->bytes_rw = 0;
				_func_exit_;
				return NDIS_STATUS_BUFFER_TOO_SHORT;
		}
		
		bufSizeRequired = sizeof(u32);

		pNdisBssListEx = (PNDIS_802_11_BSSID_LIST_EX)poid_par_priv->information_buf;
		
		pNdisBssListEx->NumberOfItems = 0;

		pNdisBssEx = &(pNdisBssListEx->Bssid[0]);


		//this is a extremely special case... we shall lock scanned_queue.lock to 
		//avoid possible memory access violation...


		_enter_critical(&(pmlmepriv->scanned_queue.lock), &irqL);

		phead = get_list_head(queue);
		plist = get_next(phead);

		
		while(1)
		{
			if (end_of_queue_search(phead,plist)== _TRUE)
				break;

			pnetwork	= LIST_CONTAINOR(plist, struct wlan_network, list);

			pnetwork->network.Length = bssid_ex_sz = get_NDIS_WLAN_BSSID_EX_sz(&pnetwork->network);
		
			bufSizeRequired += bssid_ex_sz;
			
			plist = get_next(plist);
			
			if(poid_par_priv->information_buf_len < bufSizeRequired) {
				no_report = 1;
				DEBUG_INFO(("InformationBufferLength:%x, bufSizeRequired:%x\n",
					poid_par_priv->information_buf_len < bufSizeRequired));
				pNdisBssListEx->NumberOfItems = 0;
				continue;
			}
			
			//copy pnetwork->network to the specified memory....

			_memcpy((u8 *)pNdisBssEx, &(pnetwork->network), bssid_ex_sz);

			// convert channel to frequency
			pNdisBssEx->Configuration.DSConfig = (u32)ch2freq((u32)pnetwork->network.Configuration.DSConfig);
					
			pNdisBssEx = (NDIS_WLAN_BSSID_EX *)( (u32)pNdisBssEx + bssid_ex_sz);
			
			pNdisBssListEx->NumberOfItems++;
		}


		_exit_critical(&(pmlmepriv->scanned_queue.lock), &irqL);


		//RT_TRACE(COMP_SITE_SURVEY, DBG_LOUD, ("@@@@@ End of OID_802_11_BSSID_LIST--- bsscnt = %d ", pNdisBssListEx->NumberOfItems));
		DEBUG_ERR (("@@@@@ End of OID_802_11_BSSID_LIST--- bsscnt = %d ", pNdisBssListEx->NumberOfItems));
		phead = get_list_head(queue);
		plist = get_next(phead);
		

		if (no_report) {
			
			*poid_par_priv->bytes_needed = bufSizeRequired;
			
			*poid_par_priv->bytes_rw = 0;	
			_func_exit_;
			return NDIS_STATUS_BUFFER_TOO_SHORT;
		} 
		else {

			//DEBUG_ERR("Report BSS with ByteWritten = %d\n",bufSizeRequired);	

