xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
			*poid_par_priv->bytes_needed = *poid_par_priv->bytes_rw = bufSizeRequired;
			_func_exit_;	
			return NDIS_STATUS_SUCCESS;
		}

	}




}


//1Query Functions for Segment 7


/*
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	ulInfo = NdisMedium802_3;


       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);
*/

NDIS_STATUS query_oid_pnp_capabilities(struct oid_par_priv* poid_par_priv)
{

	NDIS_STATUS				status = NDIS_STATUS_SUCCESS;
	NDIS_PNP_CAPABILITIES     Power_Management_Capabilities;
	u32						ulInfoLen = sizeof(NDIS_PNP_CAPABILITIES);
	PVOID					pInfo = (PVOID) &Power_Management_Capabilities;

	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	// Not support WOL
        Power_Management_Capabilities.WakeUpCapabilities.MinMagicPacketWakeUp   = NdisDeviceStateUnspecified;
        Power_Management_Capabilities.WakeUpCapabilities.MinPatternWakeUp      	= NdisDeviceStateUnspecified;
        Power_Management_Capabilities.WakeUpCapabilities.MinLinkChangeWakeUp    = NdisDeviceStateUnspecified;
	

       status = copy_oid_info(poid_par_priv, pInfo, ulInfoLen);	
	_func_exit_;
	return (status);



}

//1Query Functions for Segment 10

NDIS_STATUS query_oid_802_11_statistics(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	ULONGLONG			ul64Info = 0;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;


	DEBUG_ERR( ("Query OID_802_11_STATISTICS: We don't support it.\n"));
	_func_exit_;
	return NDIS_STATUS_NOT_SUPPORTED;


}





//1Set Functions for Segment 1

NDIS_STATUS
set_oid_gen_current_packet_filter(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u32			PacketFilter;
	
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	if(poid_par_priv->information_buf_len != sizeof(u32)) {
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;
	}

	*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;
	PacketFilter = *(PULONG)poid_par_priv->information_buf;

	if ( (PacketFilter & NIC8711_SUPPORTED_FILTERS) == 0 ) {
		
		status = NDIS_STATUS_NOT_SUPPORTED;
		_func_exit_;
		return status;
	}

	if ( Adapter->NdisPacketFilter == PacketFilter ) {
		status = NDIS_STATUS_SUCCESS;
		_func_exit_;
		return status;
	}

	if (PacketFilter & (NDIS_PACKET_TYPE_ALL_MULTICAST | NDIS_PACKET_TYPE_PROMISCUOUS )) {
		u32	MCR[2];
		MCR[0] = 0xffffffff;
		MCR[1] = 0xffffffff;
		//3TO DO here
		//3Write this MCR to MAR0-7 Multicast Register 0-7
		/*! \todo OID_GEN_CURRENT_PACKET_FILTER : Write this MCR to MAR0-7 Multicast Register 0-7*/
		
	}

	Adapter->NdisPacketFilter = PacketFilter;
	_func_exit_;
	return (status);
	
}

NDIS_STATUS
set_oid_gen_current_lookahead(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	DEBUG_ERR( ("Set OID_GEN_CURRENT_LOOKAHEAD: Ignore it.\n"));


	_func_exit_;
	return (status);
	
}


NDIS_STATUS
set_oid_gen_protocol_options(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	_func_enter_;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;


	DEBUG_ERR( ("Set OID_GEN_PROTOCOL_OPTIONS: Ignore it.\n"));
	status = NDIS_STATUS_SUCCESS;
	_func_exit_;
	return (status);
	
}


//1Set Functions for Segment 2
//1Set Functions for Segment 3


//1Set Functions for Segment 4

NDIS_STATUS
set_oid_802_3_multicast_list(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;


	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len == 0) || (poid_par_priv->information_buf_len % 6 != 0))	{
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;
	}

	Set_802_3_MULTICAST_LIST(Adapter, (u8 *)poid_par_priv->information_buf, (u32)poid_par_priv->information_buf_len, FALSE);

	_func_exit_;
	return (status);
	
}



//1Set Functions for Segment 5
//1Set Functions for Segment 6
//1Set Functions for Segment 7

NDIS_STATUS
set_oid_pnp_set_power(struct oid_par_priv* poid_par_priv)
{
	NDIS_DEVICE_POWER_STATE new_pwr_state;
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;
	
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	if(poid_par_priv->information_buf_len < sizeof(NDIS_DEVICE_POWER_STATE))
	{
		*poid_par_priv->bytes_needed = sizeof(NDIS_DEVICE_POWER_STATE);
		_func_exit_;
		status= NDIS_STATUS_INVALID_LENGTH;
	} 
	else {
		new_pwr_state = *((NDIS_DEVICE_POWER_STATE*)poid_par_priv->information_buf);
		if(	new_pwr_state == NdisDeviceStateD0 && 
				Adapter->pwrctrlpriv.pnp_current_pwr_state > NdisDeviceStateD0)
			{ //4       Wake up.

				DEBUG_ERR(("set_oid_pnp_set_power: wake up from %d to D0\n", Adapter->pwrctrlpriv.pnp_current_pwr_state ));
				Adapter->pwrctrlpriv.pnp_current_pwr_state  = new_pwr_state;
				pnp_set_power_wakeup(Adapter);
				//4  DO SOMETHING
				
				status = NDIS_STATUS_PENDING;
			}
			else if(Adapter->pwrctrlpriv.pnp_current_pwr_state  < new_pwr_state)
			{ //4  Sleep.
				DEBUG_ERR(("Set set_oid_pnp_set_power: going to sleep: %d\n", new_pwr_state));
				Adapter->pwrctrlpriv.pnp_current_pwr_state  = new_pwr_state;
				ret=pnp_set_power_sleep(Adapter);
				//4 DO SOMETHING
				status = NDIS_STATUS_PENDING;				 
			}
			else 
			{ // Otherwise.
				DEBUG_ERR(("Set set_oid_pnp_set_power: Current: %d to New: %d\n", Adapter->pwrctrlpriv.pnp_current_pwr_state, new_pwr_state));

				status = NDIS_STATUS_SUCCESS;
			}

