xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	}

	_func_exit_;
	return status;

	
}



//1Set Functions for Segment 8

NDIS_STATUS
set_oid_802_11_bssid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	if(poid_par_priv->information_buf_len < 6)
	{
		*poid_par_priv->bytes_needed = 6;
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;
	} else 
	{
		//MgntActSet_802_11_BSSID( Adapter, (u8*)poid_par_priv->information_buf);
		*poid_par_priv->bytes_rw= 6;
	}
	_func_exit_;
	return NDIS_STATUS_SUCCESS;


	
}

NDIS_STATUS
set_oid_802_11_ssid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	
	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len == 0) ) {
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;

	} else {

		NDIS_802_11_SSID    	*ssid;
		u8 i=0;
		
		ret = _FALSE;
		
		
		if (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_SSID)){
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_SSID);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

		ssid = (NDIS_802_11_SSID *)poid_par_priv->information_buf;

		ret = set_802_11_ssid(padapter, ssid);
	
		*poid_par_priv->bytes_rw = sizeof(NDIS_802_11_SSID);
		_func_exit_;
		return NDIS_STATUS_SUCCESS;
	}
	



}

NDIS_STATUS
set_oid_802_11_infrastructure_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8				ret = _FALSE;
	struct mlme_priv 		*pmlmepriv = &padapter->mlmepriv;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < 4) )	{

		*poid_par_priv->bytes_needed = sizeof(u32);
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;

	} else {
		NDIS_802_11_NETWORK_INFRASTRUCTURE networkType = *(u32 *)poid_par_priv->information_buf;
		*poid_par_priv->bytes_rw = sizeof(u32);

		ret = set_802_11_infrastructure_mode(padapter, networkType);
		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}

}

NDIS_STATUS
set_oid_802_11_add_wep(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	BOOLEAN				ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;
	{
		NDIS_802_11_WEP	*wep;

		DEBUG_ERR(("SET OID_802_11_ADD_WEP: \n"));

		if (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_WEP) || poid_par_priv->information_buf == NULL){
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_WEP);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}
		
		wep = (NDIS_802_11_WEP	*)poid_par_priv->information_buf;
		ret =set_802_11_add_wep(Adapter, wep);

		if (ret == _FAIL){
			*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			
			*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}

	}


}

NDIS_STATUS
set_oid_802_11_remove_wep(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	BOOLEAN				ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	{
		u32			keyindex;

		if (poid_par_priv->information_buf_len < sizeof(u32) || poid_par_priv->information_buf == NULL){
			*poid_par_priv->bytes_needed = sizeof(u32);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

		keyindex = *(u32 *)poid_par_priv->information_buf;
		ret = set_802_11_remove_wep(padapter, keyindex);

		*poid_par_priv->bytes_rw = sizeof(u32);

		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}

}
	
NDIS_STATUS
set_oid_802_11_disassociate(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	BOOLEAN				ret = FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	ret = set_802_11_disassociate( Adapter);
	_func_exit_;
	return NDIS_STATUS_SUCCESS;


}
	
NDIS_STATUS	
set_oid_802_11_authentication_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

{
	NDIS_802_11_AUTHENTICATION_MODE authmode;

	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_AUTHENTICATION_MODE )) ) {
		status = NDIS_STATUS_INVALID_LENGTH;
		*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_AUTHENTICATION_MODE );
		_func_exit_;
		return status;
	}
	
	authmode = *(NDIS_802_11_AUTHENTICATION_MODE*)poid_par_priv->information_buf;
	DEBUG_ERR(("~~~~SET OID_802_11_AUTHENTICATION_MODE: %d\n", authmode));

	padapter->securitypriv.ndisauthtype=authmode;

	switch(authmode) {
		case Ndis802_11AuthModeOpen:
		case Ndis802_11AuthModeWPANone:	
			padapter->securitypriv.dot11AuthAlgrthm= 0; //open system
			if((padapter->securitypriv.ndisauthtype >1)||(padapter->securitypriv.dot11PrivacyAlgrthm>1)){
				padapter->securitypriv.ndisauthtype=1;
				padapter->securitypriv.dot11PrivacyAlgrthm=1;
				padapter->securitypriv.dot118021XGrpPrivacy=0;
			}
			break;
		case Ndis802_11AuthModeShared:
			padapter->securitypriv.dot11AuthAlgrthm= 1; //shared system
			if((padapter->securitypriv.ndisauthtype >1)||(padapter->securitypriv.dot11PrivacyAlgrthm>1)){
				padapter->securitypriv.ndisauthtype=1;
				padapter->securitypriv.dot11PrivacyAlgrthm=1;
				padapter->securitypriv.dot118021XGrpPrivacy=0;
			}
			break;
		case Ndis802_11AuthModeAutoSwitch:
			padapter->securitypriv.dot11AuthAlgrthm= 1; //shared system
			if((padapter->securitypriv.ndisauthtype >1)||(padapter->securitypriv.dot11PrivacyAlgrthm>1)){
				padapter->securitypriv.ndisauthtype=1;
				padapter->securitypriv.dot11PrivacyAlgrthm=1;
				padapter->securitypriv.dot118021XGrpPrivacy=0;
			}
			break;
		case Ndis802_11AuthModeWPA:
		case Ndis802_11AuthModeWPAPSK:
			padapter->securitypriv.dot11AuthAlgrthm= 2;  //802.1x
			break;

		case Ndis802_11AuthModeWPA2:
		case Ndis802_11AuthModeWPA2PSK:
			padapter->securitypriv.dot11AuthAlgrthm= 2; //802.1x
			break;

		default:
			status = NDIS_STATUS_INVALID_DATA;
			break;
	}
	DEBUG_ERR(("~~~~padapter->securitypriv.dot11PrivacyAlgrthm: %d\n", padapter->securitypriv.dot11PrivacyAlgrthm));

		if(status == NDIS_STATUS_SUCCESS){
			//clear keys
			//Set auth, if not at the Ad Hoc mode
			if(authmode !=Ndis802_11AuthModeWPANone)
				set_802_11_authenticaion_mode( padapter, authmode );
		}


