xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	}



	_func_exit_;
	return status;


}
		
NDIS_STATUS
set_oid_802_11_bssid_list_scan(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8				ret = _FALSE;
	_func_enter_;

	DEBUG_INFO(("+set_oid_802_11_bssid_list_scan\n"));
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	ret = set_802_11_bssid_list_scan(Adapter);
	_func_exit_;
	DEBUG_INFO(("-set_oid_802_11_bssid_list_scan\n"));
	return NDIS_STATUS_SUCCESS;
	


}
		
NDIS_STATUS
set_oid_802_11_encryption_status(struct oid_par_priv* poid_par_priv)
{
	struct sta_info *pbcmc_sta;
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;
	struct mlme_priv 		*pmlmepriv = &padapter->mlmepriv;	
	struct sta_priv * pstapriv = &padapter->stapriv;
	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	{
		
	u8 * pbssid;

	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_WEP_STATUS)) ) {

		*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_WEP_STATUS);
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;

	}

	padapter->securitypriv.ndisencryptstatus=*(NDIS_802_11_ENCRYPTION_STATUS *)poid_par_priv->information_buf;
	DEBUG_ERR(("~~~~~SET OID_802_11_ENCRYPTION_STATUS: %d\n", *(PNDIS_802_11_ENCRYPTION_STATUS)poid_par_priv->information_buf));



	switch(padapter->securitypriv.ndisencryptstatus) {

		case Ndis802_11EncryptionNotSupported:
		case Ndis802_11EncryptionDisabled:
		DEBUG_ERR( ("\n\tNdis802_11EncryptionNotSupport or Ndis802_11EncryptionDisabled\n"));
		padapter->securitypriv.dot11PrivacyAlgrthm=_NO_PRIVACY_;
		padapter->securitypriv.dot118021XGrpPrivacy=_NO_PRIVACY_;
		
		break;
		
		case Ndis802_11Encryption1Enabled:					
		//TODO: Enable WEP
		DEBUG_ERR(("\n\tOID_802_11_ENCRYPTION_STATUS:Ndis802_11Encryption1Enabled\n"));
		padapter->securitypriv.dot11PrivacyAlgrthm=_WEP40_;
		padapter->securitypriv.dot118021XGrpPrivacy=_WEP40_;
		
		break;
		case Ndis802_11Encryption2Enabled:
		//TODO: Enable WPA
		DEBUG_ERR(("\n\tOID_802_11_ENCRYPTION_STATUS:Ndis802_11Encryption2Enabled\n"));
		padapter->securitypriv.dot11PrivacyAlgrthm=_TKIP_;
		padapter->securitypriv.dot118021XGrpPrivacy=_TKIP_;
		
		break;

		case Ndis802_11Encryption3Enabled:
		DEBUG_ERR(("\n\tOID_802_11_ENCRYPTION_STATUS:Ndis802_11Encryption3Enabled\n"));
		padapter->securitypriv.dot11PrivacyAlgrthm=_AES_;
		padapter->securitypriv.dot118021XGrpPrivacy=_AES_;
		
		break;

		default:
		DEBUG_ERR(("\n\tdefault\n"));
		padapter->securitypriv.dot11PrivacyAlgrthm=_NO_PRIVACY_;
		padapter->securitypriv.dot118021XGrpPrivacy=_NO_PRIVACY_;

		break;
	}

	if(check_fwstate(pmlmepriv, WIFI_STATION_STATE | WIFI_MP_STATE)) //sta mode
	{
		pbcmc_sta = get_bcmc_stainfo(padapter);
		if(pbcmc_sta==NULL){
			DEBUG_ERR( ("set_oid_802_11_encryption_status: no bcmc stainfo \n"));
		}
		else
		{
			if((padapter->securitypriv.ndisencryptstatus == Ndis802_11Encryption2Enabled)||
					(padapter->securitypriv.ndisencryptstatus ==  Ndis802_11Encryption3Enabled))
				pbcmc_sta->ieee8021x_blocked = _TRUE;
					
		}
	}


	*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;
	_func_exit_;
	return NDIS_STATUS_SUCCESS;
	
	}

	_func_exit_;
	return status;
}
	
		
NDIS_STATUS
set_oid_802_11_reload_defaults(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_RELOAD_DEFAULTS)) ) {

		*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_RELOAD_DEFAULTS);
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;

	} else {

		NDIS_802_11_RELOAD_DEFAULTS NdisReloadDefault = *(NDIS_802_11_RELOAD_DEFAULTS *)poid_par_priv->information_buf;

		ret =set_802_11_reload_defaults(padapter, NdisReloadDefault);
		
//		*poid_par_priv->bytes_rw = sizeof(RT_802_11_RELOAD_DEFAULTS);
		
		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}	


}
			
void PlatformRequestPreAuthentication(_adapter * padapter)
{
	u8 authmode,securitytype,cnt,match,remove_cnt;
	u8 sec_ie[255],uncst_oui[4],bkup_ie[255];
	u8 wpa_oui[4]={0x0,0x50,0xf2,0x01};
	uint 	ielength;
	int iEntry,i, j;
	struct	security_priv	*psecuritypriv=&padapter->securitypriv;
	struct mlme_priv 		*pmlmepriv = &padapter->mlmepriv;	

	uint	ndissecuritytype=psecuritypriv->ndisencryptstatus;
	uint 	ndisauthmode=psecuritypriv->ndisauthtype;
	u8	uArray[sizeof(NDIS_802_11_STATUS_INDICATION) + \
						(NUM_PRE_AUTH_KEY+1)*sizeof(NDIS_802_11_AUTHENTICATION_REQUEST) +1 ];
	u8 *	pucCurPtr;
	PNDIS_802_11_PMKID_CANDIDATE_LIST 	pPMKID;
	PPMKID_CANDIDATE					pCandidate;
	int				iNumBssid=0;
	u8 * currentbssid = get_bssid(pmlmepriv);

	//
	// Condition Check
	//
	if(ndisauthmode!=Ndis802_11AuthModeWPA2)
	{
		return;
	}

	//
	// Initialize the buffer for status indication.
	//
	memset(uArray, 0, sizeof uArray );

	pucCurPtr = &uArray[0];
	*((PNDIS_802_11_STATUS_TYPE)pucCurPtr) = 2;//Ndis802_11StatusType_PMKID_CandidateList;
	pucCurPtr += sizeof(NDIS_802_11_STATUS_TYPE);

	//------------------------------------------------------------------
	// (1) Include associated current BSSID into list
	//------------------------------------------------------------------
	// Fill Version and NumCandidates field in NDIS_802_11_PMKID_CANDIDATE_LIST.
	pPMKID = (PNDIS_802_11_PMKID_CANDIDATE_LIST)pucCurPtr;
	pPMKID->Version = 1;	//OID Ducument: This value should be 1
	pPMKID->NumCandidates = 0;	// [AnnieNote] Why Zero????????? 2006-05-08.
	pucCurPtr = (u8 *)pPMKID->CandidateList;
	
	// The current associated BSSID should always be in the StatusBuffer.		
	pCandidate = (PPMKID_CANDIDATE)pucCurPtr;
	pCandidate->Flags = 1;//NDIS_802_11_PMKID_CANDIDATE_PREAUTH_ENABLED;
	
	_memcpy( pCandidate->BSSID, currentbssid, 6 );
	iNumBssid++;	
	pucCurPtr += sizeof(PMKID_CANDIDATE);		// pointer to next PMKID_CANDIDATE.


	//------------------------------------------------------------------
	// (2) Include other BSSID for roaming candidate list (with the same SSID)
	//------------------------------------------------------------------	

	// Add the bssid onto bssid list
	pCandidate = (PPMKID_CANDIDATE)pucCurPtr;
	pCandidate->Flags = 0x0;

	_memcpy( pCandidate->BSSID, currentbssid, 6 );
	iNumBssid++;
	pucCurPtr += sizeof(PMKID_CANDIDATE);

