xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	pPMKID->NumCandidates = iNumBssid;

	//------------------------------------------------------------------
	// (3) Indicate to upper layer.
	//------------------------------------------------------------------
	{
		
		UINT	UsedSize =	sizeof(NDIS_802_11_STATUS_INDICATION)	+	\
							sizeof(NDIS_802_11_PMKID_CANDIDATE_LIST)	+	\
							(iNumBssid-1)*sizeof(PMKID_CANDIDATE);
		NdisMIndicateStatus(padapter->hndis_adapter, 
						NDIS_STATUS_MEDIA_SPECIFIC_INDICATION, 
						(PVOID)uArray,
						UsedSize	);
		NdisMIndicateStatusComplete( padapter->hndis_adapter );
	}
}

NDIS_STATUS
set_oid_802_11_add_key(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;
	struct mlme_priv 		*pmlmepriv = &padapter->mlmepriv;	

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;


	{
		NDIS_802_11_KEY		*key;

		if ( poid_par_priv->information_buf == NULL)//if (InformationBufferLength < sizeof(NDIS_802_11_KEY) || InformationBuffer == NULL)
		{
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_KEY);
			*poid_par_priv->bytes_rw = 0;
			DEBUG_ERR(("OID_802_11_ADD_KEY:NDIS_STATUS_INVALID_LENGTH\n"));
			DEBUG_ERR(("OID_802_11_ADD_KEY:InformationBufferLength=%d sizeof(NDIS_802_11_KEY)=%d sizeof(NDIS_802_11_WEP)=%d\n",
											poid_par_priv->information_buf_len, sizeof(NDIS_802_11_KEY),sizeof(NDIS_802_11_WEP)));
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

		key = (NDIS_802_11_KEY *)poid_par_priv->information_buf;
		ret = set_802_11_add_key(padapter, key);
		
		if(padapter->securitypriv.dot11AuthAlgrthm== 2) // 802_1x
		{
			struct sta_info * psta,*pbcmc_sta;
			struct sta_priv * pstapriv = &padapter->stapriv;

			if(check_fwstate(pmlmepriv, WIFI_STATION_STATE | WIFI_MP_STATE)) //sta mode
			{
				psta = get_stainfo(pstapriv, get_bssid(pmlmepriv));
				
				if(psta==NULL){
					DEBUG_ERR( ("Set OID_802_11_ADD_KEY: Obtain Sta_info fail \n"));
				}
				else
				{
					psta->ieee8021x_blocked = _FALSE;
					DEBUG_ERR(("\n set_oid_802_11_add_key:ieee8021x_blocked= _FALSE\n"));
					if((padapter->securitypriv.ndisencryptstatus == Ndis802_11Encryption2Enabled)||
						(padapter->securitypriv.ndisencryptstatus ==  Ndis802_11Encryption3Enabled))
						psta->dot118021XPrivacy =padapter->securitypriv.dot11PrivacyAlgrthm;						
					
				}

				pbcmc_sta=get_bcmc_stainfo(padapter);
				if(pbcmc_sta==NULL){
					DEBUG_ERR( ("Set OID_802_11_ADD_KEY: bcmc stainfo is null \n"));
				}
				else
				{
					pbcmc_sta->ieee8021x_blocked = _FALSE;
					DEBUG_ERR(("\n set_oid_802_11_add_key:ieee8021x_blocked= _FALSE\n"));
					if((padapter->securitypriv.ndisencryptstatus == Ndis802_11Encryption2Enabled)||
						(padapter->securitypriv.ndisencryptstatus ==  Ndis802_11Encryption3Enabled))
						pbcmc_sta->dot118021XPrivacy =padapter->securitypriv.dot11PrivacyAlgrthm;						
					
				}
			}

			else if(check_fwstate(pmlmepriv, WIFI_ADHOC_STATE)) //adhoc mode
			{					}
			
		}				

		*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;

		PlatformRequestPreAuthentication(padapter);		

		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}


	
}
			
NDIS_STATUS
set_oid_802_11_remove_key(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	{
		NDIS_802_11_REMOVE_KEY	*key = NULL;

		if (poid_par_priv->information_buf_len < sizeof(PNDIS_802_11_REMOVE_KEY) || poid_par_priv->information_buf == NULL){
			*poid_par_priv->bytes_needed = sizeof(PNDIS_802_11_REMOVE_KEY);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}


		key = (NDIS_802_11_REMOVE_KEY *)poid_par_priv->information_buf;
		
		ret = set_802_11_remove_key(padapter, key);
		*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;

		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}

}
			
NDIS_STATUS
set_oid_802_11_test(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			padapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8				ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	{
		NDIS_802_11_TEST *test = NULL;

		DEBUG_ERR( ("Set OID_802_11_TEST.\n"));


		if (poid_par_priv->information_buf_len < sizeof(NDIS_802_11_TEST) || poid_par_priv->information_buf == NULL){
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_TEST);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

		test = (NDIS_802_11_TEST *)poid_par_priv->information_buf;
		
		ret = set_802_11_test(padapter, test);

		*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;

		if (ret == _FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}


}
			
NDIS_STATUS
set_oid_802_11_pmkid(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8 			i,j,blInserted = _FALSE;
	u8				ret = _FALSE;
	struct mlme_priv			*pmlmepriv = &Adapter->mlmepriv;
	struct security_priv *psecuritypriv=&Adapter->securitypriv;
	PBSSIDInfo pBssidInfo;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	{
		
		NDIS_802_11_PMKID *pmkid = NULL;

		if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < 4) ){
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_PMKID);
			*poid_par_priv->bytes_rw = 0;
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

