xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
		pmkid = (NDIS_802_11_PMKID *)poid_par_priv->information_buf;
		pBssidInfo = (PBSSIDInfo)(pmkid->BSSIDInfo);	//handle PMKID

	for( i=0; i<pmkid->BSSIDInfoCount; i++ )
	{
		if( i >= NUM_PMKID_CACHE )
		{
			break;
		}

		blInserted = _FALSE;
		
		//overwrite PMKID
		for(j=0 ; j<NUM_PMKID_CACHE; j++)
		{
			if(_memcmp(psecuritypriv->PMKIDList[j].Bssid, pBssidInfo->BSSID, ETH_ALEN)==_TRUE )
			{ // BSSID is matched, the same AP => rewrite with new PMKID.
				_memcpy(psecuritypriv->PMKIDList[j].PMKID, pBssidInfo->PMKID, sizeof(pBssidInfo->PMKID));
				psecuritypriv->PMKIDIndex = j+1;
				blInserted = _TRUE;
				break;
			}	
		}

		if(blInserted){
			break;
		}
		else{
			// Find a new entry
			_memcpy(psecuritypriv->PMKIDList[psecuritypriv->PMKIDIndex].Bssid, pBssidInfo->BSSID, ETH_ALEN);
			_memcpy(psecuritypriv->PMKIDList[psecuritypriv->PMKIDIndex].PMKID, pBssidInfo->PMKID, 16);
			psecuritypriv->PMKIDIndex ++ ;
			if(psecuritypriv->PMKIDIndex==16)
				psecuritypriv->PMKIDIndex =0;
		}

		pBssidInfo ++;	// pointer to next BSSID_INFO.		}
	}

		ret = set_802_11_pmkid(Adapter, pmkid);

		*poid_par_priv->bytes_rw = poid_par_priv->information_buf_len;

		if (ret == FALSE){
			_func_exit_;
			return NDIS_STATUS_INVALID_DATA;
		} else {
			_func_exit_;
			return NDIS_STATUS_SUCCESS;
		}
	}

}



//1Set Functions for Segment 9

NDIS_STATUS
set_oid_802_11_network_type_in_use(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;
	struct mlme_priv 		*pmlmepriv = &Adapter->mlmepriv;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;

	{
	
		NDIS_WLAN_BSSID_EX *pnetwork;
		u8* pnetwork_in_use = NULL;

		DEBUG_ERR( ("Set OID_802_11_NETWORK_TYPE_IN_USE:%d \n", poid_par_priv->information_buf));

		if( (poid_par_priv->information_buf == 0) || (poid_par_priv->information_buf_len < 4) )	{
				*poid_par_priv->bytes_needed = sizeof(u32);
				_func_exit_;
				return NDIS_STATUS_INVALID_LENGTH;
		}
		
		
		if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) ||
			(check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) == _TRUE))
		{
			pnetwork = &pmlmepriv->cur_network.network;
		}
		
		else
		{
			pnetwork = &(Adapter->registrypriv.dev_network);
			pnetwork_in_use = &Adapter->registrypriv.wireless_mode;
		}


		//HCT12.0 NDTest
		if ((*(PULONG)poid_par_priv->information_buf == Ndis802_11OFDM5)||
			(*(PULONG)poid_par_priv->information_buf == Ndis802_11OFDM24) || 
			(*(PULONG)poid_par_priv->information_buf == Ndis802_11DS) )	{

			//Adapter->NdisCEDev.BeSetNetworkTypeByNDTest = (NDIS_802_11_NETWORK_TYPE)(*(PULONG)InformationBuffer);
			pnetwork->NetworkTypeInUse = (NDIS_802_11_NETWORK_TYPE)(*(PULONG)poid_par_priv->information_buf);
			if(pnetwork_in_use)
			{
				switch(*(PULONG)poid_par_priv->information_buf)
				{
					case Ndis802_11OFDM5:
						*pnetwork_in_use = WIRELESS_11A;
						break;

					case Ndis802_11OFDM24:
						*pnetwork_in_use = WIRELESS_11BG;
						break;

					case Ndis802_11DS:
						*pnetwork_in_use = WIRELESS_11B;
						break;
				}
			}
			
		} else {

			pnetwork->NetworkTypeInUse = (NDIS_802_11_NETWORK_TYPE)0;
			status = NDIS_STATUS_INVALID_DATA;
		}

		*poid_par_priv->bytes_rw =  sizeof(NDIS_802_11_NETWORK_TYPE);
		_func_exit_;
		return status;
	}



	
}

NDIS_STATUS
set_oid_802_11_configuration(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	BOOLEAN				ret = FALSE;
	struct mlme_priv 		*pmlmepriv = &Adapter->mlmepriv;
	struct registry_priv	*pregistrypriv = &Adapter->registrypriv;
	NDIS_WLAN_BSSID_EX    *pdev_network = &pregistrypriv->dev_network;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;

	_func_enter_;

	if( (poid_par_priv->information_buf == 0) || 
		(poid_par_priv->information_buf_len < sizeof(NDIS_802_11_CONFIGURATION)) )
	{
		*poid_par_priv->bytes_rw = 0;
		*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_CONFIGURATION);
		_func_exit_;
		return NDIS_STATUS_INVALID_LENGTH;
	}
	else
	{	
		NDIS_WLAN_BSSID_EX *pnetwork=NULL ;
		u8 * pchannel = NULL;
		NDIS_802_11_CONFIGURATION *Config80211 = (NDIS_802_11_CONFIGURATION *)poid_par_priv->information_buf;

		if(check_fwstate(pmlmepriv, _FW_LINKED))
			pnetwork = &pmlmepriv->cur_network.network;
		else
		{
			//return NDIS_STATUS_INVALID_LENGTH;
			//pnetwork = &(Adapter->registrypriv.dev_network);
			//pchannel = &Adapter->registrypriv.channel;
		}

		if(pnetwork)
			_memcpy(&pnetwork->Configuration, &Config80211, Config80211->Length);

		if(pchannel)
			*pchannel = (u8) freq2ch(Config80211->DSConfig);

		
		// double check
		if(!((check_fwstate(pmlmepriv, WIFI_ADHOC_STATE)==_TRUE) ||
			(check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE)==_TRUE) ))

		{
			if(pnetwork)
			{
				if(pnetwork->Configuration.DSConfig != 0||
				pnetwork->Configuration.ATIMWindow != 0 )
				{
					pnetwork->Configuration.DSConfig = 0 ;
					pnetwork->Configuration.ATIMWindow = 0 ;
					DEBUG_ERR( ("*** Error? Not AdhocMode but DSConfig != 0 || ATIMWindow != 0***\n\n"));
				}
			}
		}
		
		//Update channel for using Funk Software in ad hoc master mode
		pdev_network->Configuration.DSConfig = freq2ch(Config80211->DSConfig/1000);
		pregistrypriv->channel = (u8)pdev_network->Configuration.DSConfig;

		
	}

	*poid_par_priv->bytes_rw = sizeof(NDIS_802_11_CONFIGURATION);
	_func_exit_;
	return NDIS_STATUS_SUCCESS;

	
}

NDIS_STATUS
set_oid_802_11_power_mode(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS			status = NDIS_STATUS_SUCCESS;
	u32			ulInfo = 0;
	u32			ulInfoLen = sizeof(ulInfo);
	PVOID				pInfo = (PVOID) &ulInfo;
	PADAPTER			Adapter = (PADAPTER)(poid_par_priv->adapter_context);
	u8			ret = _FALSE;

	*poid_par_priv->bytes_rw = 0;
	*poid_par_priv->bytes_needed = 0;
	_func_enter_;
	{
		NDIS_802_11_POWER_MODE ndisPsModeToSet;
		ps_mode rtPsModeToSet;

		if( (poid_par_priv->information_buf == NULL) || 	(poid_par_priv->information_buf_len < sizeof(NDIS_802_11_POWER_MODE)) ) {
			*poid_par_priv->bytes_needed = sizeof(NDIS_802_11_AUTHENTICATION_MODE );
			_func_exit_;
			return NDIS_STATUS_INVALID_LENGTH;
		}

