xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
		ndisPsModeToSet = *((NDIS_802_11_POWER_MODE*)poid_par_priv->information_buf);
		DEBUG_ERR( ("Set OID_802_11_POWER_MODE: 0x%X\n", ndisPsModeToSet));
	}

	_func_exit_;
	return status;

	
}





//1Set Functions for Segment 10




//1OID Handler for Segment 1


NDIS_STATUS
oid_gen_hardware_status_hdl(struct oid_par_priv* poid_par_priv)
{	

	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_hardware_status(poid_par_priv);	
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
	
}







NDIS_STATUS
oid_gen_supported_list_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_supported_list(poid_par_priv);	
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


#define query_oid_hdl query_ ## __FUNCTION__



NDIS_STATUS
oid_gen_media_supported_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_media_supported(poid_par_priv);		
			//status = query_oid_hdl(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


NDIS_STATUS
oid_gen_media_in_use_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_media_in_use(poid_par_priv);					
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


NDIS_STATUS
oid_gen_maximum_lookahead_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_maximum_lookahead(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_maximum_frame_size_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_maximum_frame_size(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_link_speed_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_link_speed_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}




NDIS_STATUS
oid_gen_transmit_buffer_space_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_transmit_buffer_space_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}





NDIS_STATUS
oid_gen_receive_buffer_space_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_receive_buffer_space_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_transmit_block_size_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_transmit_block_size(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


NDIS_STATUS
oid_gen_receive_block_size_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_receive_block_size(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_vendor_id_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_vendor_id_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}




NDIS_STATUS
oid_gen_vendor_description_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_vendor_description_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}				
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_current_packet_filter_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_current_packet_filter(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_gen_current_packet_filter(poid_par_priv);			
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_current_lookahead_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_current_lookahead(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_gen_current_lookahead(poid_par_priv);		
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}




NDIS_STATUS
oid_gen_driver_version_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_driver_version_hdl(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_maximum_total_size_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_maximum_total_size(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_protocol_options_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			set_oid_gen_protocol_options(poid_par_priv);
			break;
	}			
	_func_exit_;
	return status;
}



NDIS_STATUS
oid_gen_mac_options_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_mac_options(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}




NDIS_STATUS
oid_gen_media_connect_status_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_media_connect_status(poid_par_priv);		
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_maximum_send_packets_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_maximum_send_packets(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


NDIS_STATUS
oid_gen_vendor_driver_version_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_vendor_driver_version(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



//1OID Handler for Segment 2

NDIS_STATUS
oid_gen_physical_medium_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
#ifndef WINDOWS_VIRTUAL		
	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_physical_medium(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			

#endif
	_func_exit_;
	return status;
}


//1OID Handler for Segment 3

NDIS_STATUS
oid_gen_xmit_ok_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_xmit_ok(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_rcv_ok_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_rcv_ok(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_xmit_error_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_xmit_error(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_rcv_error_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_rcv_error(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_gen_rcv_no_buffer_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_gen_rcv_no_buffer(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}





//1OID Handler for Segment 4

NDIS_STATUS
oid_802_3_permanent_address_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_permanent_address(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_current_address_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_current_address(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_multicast_list_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_multicast_list(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_3_multicast_list(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_maximum_list_size_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_maximum_list_size(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_mac_options_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}



