xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
//1OID Handler for Segment 5

NDIS_STATUS
oid_802_3_rcv_error_alignment_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_rcv_error_alignment(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_one_collision_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_xmit_one_collision(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_more_collisions_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_3_xmit_more_collisions(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


//1OID Handler for Segment 6

NDIS_STATUS
oid_802_3_xmit_deferred_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "oid_802_3_xmit_deferred Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_max_collisions_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_rcv_overrun_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_underrun_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");	
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_heartbeat_failure_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_times_crs_lost_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_3_xmit_late_collisions_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}



