xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
//1OID Handler for Segment 7

NDIS_STATUS
oid_pnp_capabilities_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_pnp_capabilities(poid_par_priv);	
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_set_power_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status=set_oid_pnp_set_power(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_query_power_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			query_oid_pnp_query_power(poid_par_priv);
			status = NDIS_STATUS_SUCCESS;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_add_wake_up_pattern_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_remove_wake_up_pattern_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_wake_up_pattern_list_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_pnp_enable_wake_up_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}



//1OID Handler for Segment 8

NDIS_STATUS
oid_802_11_bssid_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_bssid(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_ssid_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			query_oid_802_11_ssid(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			set_oid_802_11_ssid(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_infrastructure_mode_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_infrastructure_mode(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_infrastructure_mode(poid_par_priv);			
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_add_wep_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_add_wep(poid_par_priv);			
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_remove_wep_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_remove_wep(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_disassociate_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_disassociate(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_authentication_mode_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_authentication_mode(poid_par_priv);			
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_authentication_mode(poid_par_priv);			
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_privacy_filter_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "oid_802_11_privacy_filter Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_bssid_list_scan_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_bssid_list_scan(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_encryption_status_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_encryption_status(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_encryption_status(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_reload_defaults_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_reload_defaults(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_add_key_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_add_key(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}				
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_remove_key_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_remove_key(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_association_information_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_association_information(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS	
oid_802_11_test_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_test(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}				
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_media_stream_mode_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_capability_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_capability(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}


NDIS_STATUS
oid_802_11_pmkid_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status =	query_oid_802_11_pmkid(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_pmkid(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}




//1OID Handler for Segment 9

NDIS_STATUS
oid_802_11_network_types_supported_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_network_types_supported(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_network_type_in_use_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_network_type_in_use(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_network_type_in_use(poid_par_priv);	
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_tx_power_level_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_rssi_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			query_oid_802_11_rssi(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_rssi_trigger_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_fragmentation_threshold_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_rts_threshold_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_number_of_antennas_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_rx_antenna_selected_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_tx_antenna_selected_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

