xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
NDIS_STATUS
oid_802_11_supported_rates_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_supported_rates(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;}

NDIS_STATUS
oid_802_11_desired_rates_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
/*	
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			DEBUG_OID(poid_par_priv->dbg, "Query operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
*/
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_configuration_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_configuration(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_configuration(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_power_mode_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_power_mode(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			status = set_oid_802_11_power_mode(poid_par_priv);
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}

NDIS_STATUS
oid_802_11_bssid_list_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_bssid_list(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}






//1OID Handler for Segment 10

NDIS_STATUS
oid_802_11_statistics_hdl(struct oid_par_priv* poid_par_priv)
{
	NDIS_STATUS	 status = NDIS_STATUS_SUCCESS;	
	_func_enter_;
	switch(poid_par_priv->type_of_oid)
	{
		case QUERY_OID:
			DEBUG_OID(poid_par_priv->dbg, "Query\n");
			status = query_oid_802_11_statistics(poid_par_priv);
			break;
		case SET_OID:
			DEBUG_OID(poid_par_priv->dbg, "Set\n");
			DEBUG_OID(poid_par_priv->dbg, "Set operation is not supported!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
		default:
			DEBUG_OID(poid_par_priv->dbg, "Error OID type ... choose set or query!\n");
			status = NDIS_STATUS_NOT_SUPPORTED;
			break;
	}			
	_func_exit_;
	return status;
}





/*! \brief NDIS will pass OIDs to this function. this function must process these OIDs. */
NDIS_STATUS drv_query_info(
	IN	_nic_hdl		MiniportAdapterContext,
	IN	NDIS_OID		Oid,
	IN	PVOID			InformationBuffer,
	IN	ULONG			InformationBufferLength,
	OUT	PULONG			BytesWritten,
	OUT	PULONG			BytesNeeded
	)
{
	struct oid_par_priv 	oid_par;
	
	NDIS_STATUS			Status = NDIS_STATUS_SUCCESS;
	PADAPTER			Adapter = (PADAPTER)MiniportAdapterContext;
	u8			offset;
	u32 i;

	*BytesWritten = 0;
	*BytesNeeded = 0;

	oid_par.adapter_context = MiniportAdapterContext;
	oid_par.oid = Oid;
	oid_par.information_buf = InformationBuffer;
	oid_par.information_buf_len = InformationBufferLength;
	oid_par.bytes_rw = BytesWritten;
	oid_par.bytes_needed = BytesNeeded;
	oid_par.type_of_oid = QUERY_OID;	
	oid_par.dbg = 0;

	_func_enter_;
	if(Adapter->bSurpriseRemoved){
		DEBUG_ERR(("drv_query_info:Adapter->bSurpriseRemoved"));
		goto exit;
	}
			
	for(i = 0; i < sizeof(oid_funs_array)/sizeof(struct oid_funs_node) ; i++)
	{	
	
		//If this segment of OID
		if(Oid >= oid_funs_array[i].oid_start && Oid <= oid_funs_array[i].oid_end)
		{			
		
			offset = (u8)(Oid - oid_funs_array[i].oid_start);

			//If offset is inside the boundary of this corresponding array
			if(offset < oid_funs_array[i].array_sz/sizeof(struct oid_obj_priv))
			{
				oid_par.dbg = oid_funs_array[i].node_array[offset].dbg; //Whether to print debug message
				Status = oid_funs_array[i].node_array[offset].oidfuns(&oid_par);	//OID handler function call
				oid_funs_array[i].query_counter++; // Count query hit numbers for each segment 
				break;			
			}			
			else
			{
				DEBUG_ERR(("Non-Executable OID\n"));
				break;
			}
			
		}
		
	}


	switch(Oid & 0xFFFFFF00)			
	{
	
#ifdef CONFIG_MP_INCLUDED

		case OID_MP_SEG1:			
		case OID_MP_SEG2:					
		case OID_MP_SEG3:			
		case OID_MP_SEG4:	
			Status=mp_query_info(Adapter,//MPPerformQueryInformation(Adapter,
							                                Oid,
							                               (u8*)InformationBuffer,
							                               (u32)InformationBufferLength,
							                               BytesWritten,
	  						                               BytesNeeded);
			
			*BytesWritten = InformationBufferLength;			
			break;		

#endif



