xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/ioctl/rtl871x_ioctl.c
	}
exit:
	_func_exit_;
	return(Status);
}




/*! \brief Compute CRC32 */
u32 ComputeCrc(u8 *Buffer, u32	Length) {
    u32	Crc, Carry;
    u32	i, j;
    u8	CurByte;

    Crc = 0xffffffff;
	_func_enter_;
    for (i = 0; i < Length; i++)
    {
        CurByte = Buffer[i];
        for (j = 0; j < 8; j++)
        {
            Carry = ((Crc & 0x80000000) ? 1 : 0) ^ (CurByte & 0x01);
            Crc <<= 1;
            CurByte >>= 1;
            if (Carry)
            {
                Crc = (Crc ^ 0x04c11db6) | Carry;
            }
        }
    }
    Crc = Crc & 0x0ff000000;                    // 95.05.04     Sid
    _func_exit_;
    return Crc;
}

/*! \brief ?? */
VOID GetMulticastBit(IN u8 Address[6], OUT u8 * Byte, OUT u8 *Value){
    u32 	Crc;
    u32 	BitNumber;

    Crc = ComputeCrc(Address, 6);
	_func_enter_;
    // The bit number is now in the 6 most significant bits of CRC.
    BitNumber = (u32)((Crc >> 26) & 0x3f);
    *Byte = (u8)(BitNumber / 8);
    *Value = (u8)((u8)1 << (BitNumber % 8));
	_func_exit_;
}

/*! \brief Get the Multicast List maintained by Driver. */
VOID Get_802_3_MULTICAST_LIST(PADAPTER Adapter, OUT u8 *buffer, OUT u32 *length){
	_func_enter_;
	if (Adapter->MCAddrCount == 0){
		*length = 0;
	} else {
		*length = Adapter->MCAddrCount * 6;
		_memcpy(buffer, Adapter->MCList, *length);
	}
	_func_exit_;
	return;	

}

/*! \brief Set the Multicast List specified by NDIS. */
VOID Set_802_3_MULTICAST_LIST(PADAPTER Adapter, u8 *MCListbuf, u32 MCListlen, BOOLEAN bAcceptAllMulticast) {
// ----------MgntInfo----------------------
//	PMGNT_INFO		pMgntInfo = &Adapter->MgntInfo;
	u8			MCReg[8];
	u32			i;
	u8 			Byte;
	u8			Bit;
	_func_enter_;
	Adapter->MCAddrCount = MCListlen/6;

	_memcpy( Adapter->MCList, MCListbuf, MCListlen );
	for( i = 0 ; i < 8; i++ ){ MCReg[i] = 0; }

	for( i = 0 ; i < Adapter->MCAddrCount; i++ ){
		if( i< MAX_MCAST_LIST_NUM ){
			GetMulticastBit( Adapter->MCList[i], &Byte, &Bit );
			MCReg[Byte] |= Bit;
		}
	}
// ----------MgntInfo----------------------
/*
	if( pMgntInfo->mActingAsAp || bAcceptAllMulticast ){
		_MAR[0] = 0xffffffff;
		_MAR[1] = 0xffffffff;
	} else {
		_MAR[0] = 0;
		_MAR[1] = 0;

		for (i = 0 ; i < 4; i++)	{
			_MAR[0] = _MAR[0] + ((MCReg[i])<<(8*i));
		}
		
		for (i = 4; i < 8; i++)	{
			_MAR[1] = _MAR[1] + ((MCReg[i])<<(8*(i-4)));
		}
	}
*/
	//3TO DO here...
	//3Adapter->HalFunc.SetHwRegHandler( Adapter, HW_VAR_MULTICAST_REG, (pUCHAR)(&MCR[0]) );
	/*! \todo Write MAR into 8711's Multicast Registers. */
	_func_exit_;
}


NDIS_STATUS
drv_set_info(
	IN	_nic_hdl		MiniportAdapterContext,
	IN	NDIS_OID		Oid,
	IN	PVOID			InformationBuffer,
	IN	u32		InformationBufferLength,
	OUT	u32*	BytesRead,
	OUT	u32*	BytesNeeded
	)
{
	struct oid_par_priv		oid_par;
	u32 						i;

	
	PADAPTER				Adapter = (PADAPTER)MiniportAdapterContext;
	u8 			offset = (u8)(Oid & 0xFF);
	NDIS_STATUS				Status = NDIS_STATUS_SUCCESS;


	*BytesRead = 0;

	oid_par.adapter_context = MiniportAdapterContext;
	oid_par.oid = Oid;
	oid_par.information_buf = InformationBuffer;
	oid_par.information_buf_len = InformationBufferLength;
	oid_par.bytes_rw = BytesRead;
	oid_par.bytes_needed = BytesNeeded;
	oid_par.type_of_oid = SET_OID;		
	oid_par.dbg = 0;


	_func_enter_;
	if(Adapter->bSurpriseRemoved){
		DEBUG_ERR(("drv_set_info:Adapter->bSurpriseRemoved"));
		goto exit;
	}
		
	for(i = 0; i < sizeof(oid_funs_array)/sizeof(struct oid_funs_node) ; i++)
	{	
	
		//If this segment of OID
		if(Oid >= oid_funs_array[i].oid_start && Oid <= oid_funs_array[i].oid_end)
		{			
		
			offset = (u8)(Oid - oid_funs_array[i].oid_start);

			//If offset is inside the boundary of this corresponding array
			if(offset < oid_funs_array[i].array_sz/sizeof(struct oid_obj_priv))
			{
				oid_par.dbg = oid_funs_array[i].node_array[offset].dbg; //Whether to print debug message
				Status = oid_funs_array[i].node_array[offset].oidfuns(&oid_par);	//OID handler function call
				oid_funs_array[i].set_counter++; // Count set hit numbers for each segment 
				break;			
			}	
			else
			{
				DEBUG_ERR(("Non-Executable OID\n"));
				break;
			}
			
			break;
		}
		
	}




	switch(Oid & 0xFFFFFF00)	
	{

		
#ifdef CONFIG_MP_INCLUDED	

		case OID_MP_SEG1:			
		case OID_MP_SEG2:					
		case OID_MP_SEG3:			
		case OID_MP_SEG4:	
		
			Status=mp_set_info(Adapter,//MPPerformSetInformation(Adapter,
						                           Oid,
						                           (u8*)InformationBuffer,
						                           (u32)InformationBufferLength,
						                           BytesRead,
						                           BytesNeeded
						                           );
			break;			

#endif

	


			
	}
exit:
	_func_exit_;
	return Status;
}


